Revit 2027 API
Truss.TogglePinMember Method
Pin/Unpin a truss member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void TogglePinMember(
	ElementId elemId
)
Public Sub TogglePinMember (
	elemId As ElementId
)
public:
void TogglePinMember(
	ElementId^ elemId
)
member TogglePinMember :
        elemId : ElementId -> unit
Parameters
elemId ElementId
The member element is going to pin/unpin.
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace